software-engineering/debug/软件调试的艺术.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 二 10:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>软件调试的艺术读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">软件调试的艺术读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge94e76c">1. 第一章 预备知识</a></li>
<li><a href="#org29ad9b1">2. 第二章 停下来环顾程序</a></li>
<li><a href="#org3838474">3. 第三章 检查和设置变量</a></li>
<li><a href="#org08fd597">4. 第四章 程序崩溃处理</a></li>
<li><a href="#orgd27551c">5. 第五章 多活动上下文中的调试</a></li>
<li><a href="#org52e88b5">6. 第六章 特殊主题</a></li>
<li><a href="#org16b94b4">7. 第七章 其他工具</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge94e76c" class="outline-2">
<h2 id="orge94e76c"><span class="section-number-2">1</span> 第一章 预备知识</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>调试原则：
<ul class="org-ul">
<li>确认的基本原则。</li>
<li>从简单工作开始调试。</li>
<li>使用自顶向下的方法。也就是说，调试到函数时候，先通过返回值等确定函数是否执行正确，不要着急进入函数进行单步调试浪费时间。</li>
<li>使用调试工具确定段错误的位置。</li>
<li>通过发出中断确定无限循环的位置。</li>
<li>使用二分搜索。</li>
</ul></li>
<li>调试命令：
<ul class="org-ul">
<li>断点：
<ul class="org-ul">
<li>break，clear,delete,disable,enable,enable once, info break, 。</li>
<li>tbreak</li>
<li>next,step,continue,finish，until</li>
</ul></li>

<li>打印：
<ul class="org-ul">
<li>print，list</li>
<li>watch</li>
<li>backtrace，frame</li>
</ul></li>

<li>帮助：
<ul class="org-ul">
<li>help breakpoints</li>
</ul></li>
</ul></li>

<li>图形界面:
<ul class="org-ul">
<li><p>
使用 TUI 模式
</p>
<pre class="example">
	  gdb -tui
</pre>
<p>
或者在 TUI 模式的 GDB 中使用 Ctrl+X+A 进入。
</p></li>

<li>使用 CGDB。</li>
</ul></li>

<li>启动文件 .gdbinit。</li>
</ul>
</div>
</div>

<div id="outline-container-org29ad9b1" class="outline-2">
<h2 id="org29ad9b1"><span class="section-number-2">2</span> 第二章 停下来环顾程序</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>暂停机制：断点，监视点，捕获点。</li>
<li>同一行代码上的多个断点只会中断一次，触发中断的断点将是标识符编号最小的断点。</li>
<li>使用断点命令列表在每次执行到某个断点时候自动执行一组命令。</li>
<li>调试命令：
<ul class="org-ul">
<li>commands，silent，define</li>
<li>define 使用要不停的按下回车才能不断的调用？参见第二章 fibonacci 例子。</li>
</ul></li>
<li>监视点只能监视存在且在作用域内的变量。一旦变量不再存在于调用栈的任何帧中，GDB 会自动删除监视点。</li>
</ul>
</div>
</div>

<div id="outline-container-org3838474" class="outline-2">
<h2 id="org3838474"><span class="section-number-2">3</span> 第三章 检查和设置变量</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>调试命令：
<ul class="org-ul">
<li>disp, commands, call</li>
<li>*pointer@number_of_elements</li>
<li>ptype</li>
<li>info locals</li>
<li>x</li>
<li>set</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org08fd597" class="outline-2">
<h2 id="org08fd597"><span class="section-number-2">4</span> 第四章 程序崩溃处理</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>内存布局：
<ul class="org-ul">
<li>文本区（.text）</li>
<li>数据区，包含在 <b>编译时</b> 分配的所有程序变量，即全局变量。
<ul class="org-ul">
<li>.data，</li>
<li>.bss，存放未经初始化的变量。</li>
</ul></li>
<li>操作系统不会将不完整的页分配给程序。页是虚拟内存系统能够操作的最小内存单元。这一点暗示了程序的一些错误内存访问不会触发段错误。</li>
<li>当运行程序时，操作系统创建一个用来管理执行程序代码进程的虚拟内存页表。当进程运行时，硬件的页表寄存器都会指向该表。进程虚拟空间的每个页在页表中都有一个页表项。页表项存储与该页相关的各种信息。与段错误相关的是数据该页的访问权限。</li>
<li>段错误设计访问不具备足够权限的内存。总线错误是提供给处理器的是无效地址。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd27551c" class="outline-2">
<h2 id="orgd27551c"><span class="section-number-2">5</span> 第五章 多活动上下文中的调试</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>gdb 中手工执行 connect 调用时，必须去掉类型强制转换。</li>
<li>使用 strace 跟踪程序做过的系统调用。</li>
<li>在 RUN 状态中并不表示进程实际在 CPU 上执行；相反，这仅意味着它准备运行，即有资格获得处理器的时间片。</li>
<li>调试命令：
<ul class="org-ul">
<li>info threads</li>
<li>thread 3</li>
<li>break 88 thread 3</li>
</ul></li>
<li>链接库的命令（-lpthread）要放在编译文件后面。</li>
<li>通过在代码中建立无限循环设置断点。</li>
</ul>
</div>
</div>

<div id="outline-container-org52e88b5" class="outline-2">
<h2 id="org52e88b5"><span class="section-number-2">6</span> 第六章 特殊主题</h2>
</div>

<div id="outline-container-org16b94b4" class="outline-2">
<h2 id="org16b94b4"><span class="section-number-2">7</span> 第七章 其他工具</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>strace 用来查看系统函数调用。 -s N 选项强制截短字符，使用-0 LOG ff 切换子进程。</li>
<li>ltrace 用来查看库函数调用。</li>
<li>mtrace()</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2019-08-13 二 10:41</p>
<p class="validation"></p>
</div>
</body>
</html>
